package com.ruoyi;

import org.springframework.boot.SpringApplication;
import org.springframework.boot.autoconfigure.SpringBootApplication;
import org.springframework.boot.autoconfigure.jdbc.DataSourceAutoConfiguration;
import org.springframework.context.annotation.ComponentScan;

/**
 * 启动程序
 * 
 * @author ruoyi
 */
@SpringBootApplication(exclude = { DataSourceAutoConfiguration.class })
@ComponentScan(basePackages = {
        "com.ruoyi", // 主模块的包
        "com.kekecha.xiantu" // 其他模块的包
})
public class RuoYiApplication
{
    public static void main(String[] args)
    {
        // System.setProperty("spring.devtools.restart.enabled", "false");
        SpringApplication.run(RuoYiApplication.class, args);
        System.out.println(" .----------------.  .----------------.  .----------------.  .----------------.  .----------------.  .----------------.  .----------------. \n" +
                "| .--------------. || .--------------. || .--------------. || .--------------. || .--------------. || .--------------. || .--------------. |\n" +
                "| |    _______   | || | _____  _____ | || |     ______   | || |     ______   | || |  _________   | || |    _______   | || |    _______   | |\n" +
                "| |   /  ___  |  | || ||_   _||_   _|| || |   .' ___  |  | || |   .' ___  |  | || | |_   ___  |  | || |   /  ___  |  | || |   /  ___  |  | |\n" +
                "| |  |  (__ \\_|  | || |  | |    | |  | || |  / .'   \\_|  | || |  / .'   \\_|  | || |   | |_  \\_|  | || |  |  (__ \\_|  | || |  |  (__ \\_|  | |\n" +
                "| |   '.___`-.   | || |  | '    ' |  | || |  | |         | || |  | |         | || |   |  _|  _   | || |   '.___`-.   | || |   '.___`-.   | |\n" +
                "| |  |`\\____) |  | || |   \\ `--' /   | || |  \\ `.___.'\\  | || |  \\ `.___.'\\  | || |  _| |___/ |  | || |  |`\\____) |  | || |  |`\\____) |  | |\n" +
                "| |  |_______.'  | || |    `.__.'    | || |   `._____.'  | || |   `._____.'  | || | |_________|  | || |  |_______.'  | || |  |_______.'  | |\n" +
                "| |              | || |              | || |              | || |              | || |              | || |              | || |              | |\n" +
                "| '--------------' || '--------------' || '--------------' || '--------------' || '--------------' || '--------------' || '--------------' |\n" +
                " '----------------'  '----------------'  '----------------'  '----------------'  '----------------'  '----------------'  '----------------' \n" +
                "======================================================鲜途后台管理系统初始化完毕=================================================================");
    }
}
